print('\n''---------- 1 страница ----------''\n')#сдано
# вводим список на 1 странице
tit={
    'str1':{'tit':'\t \t Министерство науки и высшего образования РФ \n \t Федеральное государственное бюджетное образовательное учреждение\n\t\t\t высшего образования\n\t"Пермский национальный исследовательский политехнический университет"'.expandtabs(10)},
    'str2':{'tit':'\t Ж У Р Н А Л \n\tучета занятий'.expandtabs(34)},
    'str3':{'tit':'2019/2020 учебный год'.center(80)},
    'str4':{'tit':'Очная форма обучения'.center(80)},
    'str5':{'tit':'Группа № АСУ2-19-1м'.center(80)},
    'str6':{'tit':'\t Направление(специальность) Информатика и вычислительная\n\t\tтехника (Интеллектуальные системы)'.expandtabs(10)}
    }
for j in tit.keys():
    print(tit[j]['tit']) # вывоим строчки
    if j=='str1'or j=='str2'or j=='str4': print('\n')# добавляем пробелы
    print('\n''---------- 2 страница ----------''\n')
    tit2 = {
        '1': {
            'tit2': '\t \t Министерство науки и высшего образования РФ \n \t Федеральное государственное бюджетное образовательное учреждение\n\t\t\t высшего образования\n\t"Пермский национальный исследовательский политехнический университет"\n'.expandtabs(
                10)},
        '2': {'tit2': 'Электротехнический факультет\n\n'.center(85)},
        '3': {'tit2': '\t Ж У Р Н А Л \n\tучета занятий\n\n'.expandtabs(34)},
        '4': {'tit2': '2019/2020 учебный год'.center(80)},
        '5': {'tit2': 'Очная форма обучения\n'.center(81)},
        '6': {'tit2': 'Группа № АСУ2-19-1м\n'.center(80)},
        '7': {
            'tit2': '\t Направление(специальность) \t Информатика и вычислительная\n\t\tтехника (Интеллектуальные системы)\n\n\n\n'.expandtabs(
                10)},
        '8': {'tit2': 'Декан факультета \t\t Костыгов Александр Михайлович\n'},
        '9': {'tit2': 'Староста группы \t\t Фоминых Полина Юрьевна\n'},
        '10': {'tit2': 'Куратор группы '}
    }  # str.center()-метод, в скобках длина строки
    # str.expandtabs()-методб расширяет ширину табов
    for k in tit2.keys():
        print(tit2[k]['tit2'])  # вывод всей стр
print('\n''---------- 3 страница ----------''\n')
# вводим список на 3 странице
book={
    -1:{'head':'СПИСОК СТУДЕНТОВ ГРУППЫ     1-й семестр''\n'},
     0: {'title':'| № п.п |   Фамилия,имя и отчество студента''\n''\t''\t''\t''\t''\t'' (полностью)''\n'},
     1: {'surname1': 'Аюпов','name': 'Александр','surname2':'Дамирович'},
     2: {'surname1': 'Барсуков','name': 'Андрей','surname2':'Сергеевич'},
     3: {'surname1': 'Беляев','name': 'Евгений','surname2':'Леонидович'},
     4: {'surname1': 'Боброва', 'name': 'Ирина', 'surname2': 'Александровна'},
     5: {'surname1': 'Гребеньщикова', 'name': 'Елизавета', 'surname2': 'Витальевна'},
     6: {'surname1': 'Клейменова', 'name': 'Вероника', 'surname2': 'Альбертовна'},
     7: {'surname1': 'Князев','name': 'Александр','surname2':'Игоревич'},
     8: {'surname1': 'Орлова','name': 'Екатерина','surname2':'Дмитриевна'},
     9: {'surname1': 'Фоминых','name': 'Полина','surname2':'Юрьевна'},
     10:{'surname1': 'Швецов','name':' Владислав','surname2':'Валерьевич'},
    }
print(book[-1]['head'])#выводим 1 строчку
print(book[0]['title'])#выводим 2 строчку
a = -2 #порядковый номер студента в списке
for i in book.keys():
    a=a+1
    if i>0:
        if a<10:
            print('   ',a,'     ',book[i]['surname1'],book[i]['name'],book[i]['surname2']) #выводим всех студентов до 10
        else:
            print('   ', a, '    ', book[i]['surname1'], book[i]['name'], book[i]['surname2']) #выводим всех студентов >= 10
# 4 страница
print('\n''---------- 4 страница ----------''\n')
key4 = "|№ п.п. | Наименование дисциплины          |Трудоемкость | Фамилия, имя, отчество преподавателя | Страницы |"
Table_of_contents={key4: {1:['Высокоинтеллектуальные платформы','\n','цифровой экономики','\t','144','   ','Мартин Кютц','\t',' 8-9'],
                            2: ['Алгоритмические языки ','\n','программирования','\t','180','   ','Курушин Даниил Сергеевич',' 10-11'],
                            3: ['Высокопроизводительные ','\n','вычисления и облачные технологии','144','   ','Сивков Сергей Павлович','   ',' 12-13'],
                            4: ['Математические методы теории','\n','систем','\t\t\t','144','\t','   Бернд Краузе ',' 14-15'],
                            5: ['Профессиональный иностранный','\n','язык','\t\t\t','72','   Хабибрахмановна Фарида Рафиковна',' 16-17'],
                            6: ['Философские проблемы науки и','\n','техники','\t\t\t','72','   Оконская Наталья Камильевна','     ',' 18-19'],
                            7: ['Деловое сотрудничество и психология','\n','взаимодействия в коллективе','       ','72','    Дуванская Мария Константиновна',' 20-21'],
                            8: ['Моделирование знаний','\t','108','    Долгова Елена Владимировна','      ',' 22-23']}}

# вывод 5 страницы
print('\n''---------- 5 страница ----------''\n')
List={}
# создаем список посещяемости, где номер элемента списка совпадает с порядковым номером в журнале
List_N=[[' '],["н","н","н","н","н","2","1"],["н","н","н"," "," "," ","3"],[" "," "," "," ","н","1"," "],
           ["н","н","н","н","н","2","1"],["н","н","н"," "," "," ","3"],[" "," "," "," ","н","1"," "],
           ["н","н","н","н","н","2","1"],["н","н","н"," "," "," ","3"],[" "," "," "," ","н","1"," "],[" "," "," "," ","н","1"," "]]
# если кого-то отчислят, то номера студентов в списке сменятся, для этого создадим еще один список с новыми порядковыми номерами и продолжим работать с ним
for i in range(1,len(List_N)):
    List[i]=List_N[i]
data=['|02.08 |','03.08 |','04.08 |','05.08 |','06.08 |']
Attendance_accounting = {'Наименование дисциплины':['Высокоинтеллектуальные платформы цифровой экономики'],
                          'семестр':[1],
                          '№ п.п.\ Дата': data, 'Количество пропусков занятий в часах |': ['\n\t\t\t\t\t\t   ','|по уважительной |','по неуважительной   |','\n\t\t\t\t\t\t  ',' |   причине      |','   причине          |']}
#-------------------------- вывод в файл ---------------------------------------------------------------------
f = open('journal.txt','w')
f.write('\n''---------- 1 страница ----------''\n\n\n')
for l in tit.keys():
    if l=='str2'or l=='str3'or l=='str5':
        f.write('\n\n\n')
    f.write(tit[l]['tit'])
    f.write('\n')
f.write('\n''---------- 2 страница ----------''\n\n\n')
for k in tit2.keys():
    f.write(tit2[k]['tit2'])
    f.write('\n')
f.write('\n\n\n''---------- 3 страница ----------''\n\n\n')
f.write(book[-1]['head'])
f.write(book[0]['title'])
f.write('\n')
k = -2
for i in book.keys():
    k=k+1
    if i>0:
        if k<10:
            f.write('    ')
            f.write(str(k))
            f.write('        ')
            f.write(book[i]['surname1'])
            f.write(' ')
            f.write(book[i]['name'])
            f.write(' ')
            f.write(book[i]['surname2'])
            f.write('\n')
        else:
            f.write('    ')
            f.write(str(k))
            f.write('       ')
            f.write(book[i]['surname1'])
            f.write(' ')
            f.write(book[i]['name'])
            f.write(' ')
            f.write(book[i]['surname2'])
f.write('\n''---------- 4 страница ----------''\n\n\n')
f.write("Оглавление"+'\n')
f.write(str(key4)+'\n')
for key1 in Table_of_contents[key4].keys():
    f.write('  '+str(key1))
    for i in range(len(Table_of_contents[key4][key1])):
        f.write('\t'+Table_of_contents[key4][key1][i])
    f.write('\n')
f.write('\n''---------- 5 страница ----------''\n\n\n')
for key in Attendance_accounting.keys():
    f.write(key+" ")
    for i in range(len(Attendance_accounting[key])):
        f.write(str(Attendance_accounting[key][i])+" ")
    if key != '№ п.п.\ Дата':
        f.write('\n')
for key in List.keys():
    f.write(str(key) +"\t")
    for i in range(len(List[key])):
        if i == 0:
            f.write("\t" + List[key][i] + "\t")
        elif (i!=len(List[key])-2):
            f.write(List[key][i]+"\t")
        else:
            f.write("\t")
            f.write(List[key][i]+"\t\t")
    f.write('\n')
f.write('\n''---------- 6 страница ----------''\n')
head6 = "|Дата проведения занятия|Вид занятия|Тема занятия (наименование в соответствии с рабочей программой)|Кол-во часов|Подпись преподавателя, проводившего занятие|"
Table6={head6: {1:['|03.09\t','\t\t','|П1\t','   ',' |Основы алгоритмов      \t\t\t\t     ','\t','    |2\t\t |'],
                            2: ['|05.09\t','\t\t','|Л1\t','   ',' |Спецификация алгоритмов\t\t\t\t     ','\t','    |4\t\t |'],
                            3: ['|06.09\t','\t\t','|П1\t','   ',' |Алгоритм сортировки    \t\t\t\t     ','\t','    |2\t\t |'] }}
f.write("Учет занятий"+'\n')
f.write(str(head6)+'\n')
for k in Table6[head6].keys():
   # f.write('  ')
    for i in range(len(Table6[head6][k])):
        f.write(Table6[head6][k][i])
    f.write('\n')
f.close()